---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurveError
source: html/be32618d-1387-6c35-5ebc-47ac905a6dd1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurveError Property

Cannot add the direction curve in the floor sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorCannotAddDirectionCurveError { get; }
```